tutorials/pehill_nut/nutfoam_inputs/foam_base/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1500
(
(0.0128788 -0.000290213 -1.58569e-24)
(0.00979908 -0.00276441 2.08408e-24)
(0.000700642 -0.000844269 0)
(-0.00219647 0.00155024 1.01371e-18)
(-0.00151167 0.00109017 0)
(-0.00199722 0.00145982 -4.22722e-21)
(-0.00222547 0.00166014 -4.56308e-19)
(-0.00219721 0.00156832 0)
...
)
;

boundaryField
{
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
