tutorials/pehill_nut/nutfoam_inputs/foam_base/constant/polyMesh/blockMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// periodic hill

convertToMeters 1;
#include "meshParameters"

Nx 50;
Ny 30;
Nz 1;

// yStar needs to be defined to esitmate dy+
yStar 0.00527;

dyOnePlus 1;

Width 0.1;
//middle 1.5;// this will be supplied in meshParameters
height 3.036;
//split 2;// this will be supplied in meshParameters
entryx0 3;// 1.9286;
entryx1 3.1;
entryx2 3.2;
entryy0 6;// 7.0714;
entryy1 5.9;
entryy2 5.8;

entryx0_9 12;// 1.9286;
entryx1_9 12.1;
entryx2_9 12.2;
entryy0_9 15;// 7.0714;
entryy1_9 14.9;
entryy2_9 14.8;

// entryx0_18 21;// 1.9286;
// entryx1_18 21.1;
// entryx2_18 21.2;
// entryy0_18 24;// 7.0714;
// entryy1_18 23.9;
// entryy2_18 23.8;

vertices
(
    (0         1        0     )   // 0
    ($entryx0  0        0     )   // 1
    ($entryx1  $middle  0     )   // 2
    (0         $split   0     )   // 3
    (0         1        $Width)   // 4
    ($entryx0  0        $Width)   // 5
    ($entryx1  $middle  $Width)   // 6
    (0         $split   $Width)   // 7

    ($entryy0  0        0     )   // 8
    ($entryy1  $middle  0     )   // 9
    ($entryy0  0        $Width)   //10
    ($entryy1  $middle  $Width)   //11

    (9         1        0     )   //12
    (9         $split   0     )   //13
    (9         1        $Width)   //14
    (9         $split   $Width)   //15

    (0         $height  0     )   //16
    ($entryx2  $height  0     )   //17
    ($entryy2  $height  0     )   //18
    (9         $height  0     )   //19

    (0         $height  $Width)   //20
    ($entryx2  $height  $Width)   //21
    ($entryy2  $height  $Width)   //22
    (9         $height  $Width)   //23

    // (9           1        0     )   // 0
    // ($entryx0_9  0        0     )   // 1
    // ($entryx1_9  $middle  0     )   // 2
    // (9           $split   0     )   // 3
    // (9           1        $Width)   // 4
    // ($entryx0_9  0        $Width)   // 5
    // ($entryx1_9  $middle  $Width)   // 6
    // (9           $split   $Width)   // 7
    //
    // ($entryy0_9  0        0     )   // 8
    // ($entryy1_9  $middle  0     )   // 9
    // ($entryy0_9  0        $Width)   //10
    // ($entryy1_9  $middle  $Width)   //11
    //
    // (18          1        0     )   //12
    // (18          $split   0     )   //13
    // (18          1        $Width)   //14
    // (18          $split   $Width)   //15
    //
    // (9           $height  0     )   //16
    // ($entryx2_9  $height  0     )   //17
    // ($entryy2_9  $height  0     )   //18
    // (18          $height  0     )   //19
    //
    // (9           $height  $Width)   //20
    // ($entryx2_9  $height  $Width)   //21
    // ($entryy2_9  $height  $Width)   //22
    // (18          $height  $Width)   //23

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($Nxh $Nyb $Nz) simpleGrading (1 $Rb 1)         //block 0
    hex (1 8 9 2 5 10 11 6) ($Nxc $Nyb $Nz) simpleGrading (1 $Rb 1)       //block 1
    hex (8 12 13 9 10 14 15 11) ($Nxh $Nyb $Nz) simpleGrading (1 $Rb 1)   //block 2
    hex (3 2 17 16 7 6 21 20) ($Nxh $Nyt $Nz) simpleGrading (1 $Rt 1)     //block 3
    hex (2 9 18 17 6 11 22 21) ($Nxc $Nyt $Nz) simpleGrading (1 $Rt 1)    //block 4
    hex (9 13 19 18 11 15 23 22) ($Nxh $Nyt $Nz) simpleGrading (1 $Rt 1)  //block 5

    // hex (12 25 26 13 14 29 30 15) ($Nxh $Nyb $Nz) simpleGrading (1 $Rb 1)         //block 0
    // hex (25 32 33 26 29 34 35 30) ($Nxc $Nyb $Nz) simpleGrading (1 $Rb 1)       //block 1
    // hex (32 36 37 33 34 38 39 35) ($Nxh $Nyb $Nz) simpleGrading (1 $Rb 1)   //block 2
    // hex (13 26 41 19 15 30 45 23) ($Nxh $Nyt $Nz) simpleGrading (1 $Rt 1)     //block 3
    // hex (26 33 42 41 30 35 46 45) ($Nxc $Nyt $Nz) simpleGrading (1 $Rt 1)    //block 4
    // hex (33 37 43 42 35 39 47 46) ($Nxh $Nyt $Nz) simpleGrading (1 $Rt 1)  //block 5
);

edges
(
    spline 0 1
    (
        (0.1607    0.9980 0)
        (0.3250    0.9629 0)
        (0.4893    0.8652 0)
        (0.6536    0.7306 0)
        (0.8179    0.5925 0)
        (0.9821    0.4620 0)
        (1.1464    0.3354 0)
        (1.3107    0.2164 0)
        (1.4750    0.1178 0)
        (1.6393    0.0482 0)
        (1.8036    0.0091 0)
        (1.9286    0      0)
        (2         0      0)
        (2.15      0      0)
        (2.3       0      0)
        (2.45      0      0)
        (2.6       0      0)
        (2.75      0      0)
        (2.87      0      0)
        (3         0      0)
    )
    spline  12 8
    (
        (8.8393  0.9980  0)
        (8.6750  0.9629  0)
        (8.5107  0.8652  0)
        (8.3464  0.7306  0)
        (8.1821  0.5925  0)
        (8.0179  0.4620  0)
        (7.8536  0.3354  0)
        (7.6893  0.2164  0)
        (7.5250  0.1178  0)
        (7.3607  0.0482  0)
        (7.1964  0.0091  0)
        (7.0714  0       0)
        (7       0       0)
        (6.85    0       0)
        (6.7     0       0)
        (6.55    0       0)
        (6.4     0       0)
        (6.25    0       0)
        (6.13    0       0)
        (6       0       0)
    )
    spline 3 2
    (
        (0.1091  2.0000  0)
        (0.2239  1.9996  0)
        (0.3387  1.9964  0)
        (0.4535  1.9888  0)
        (0.5683  1.9751  0)
        (0.6831  1.9549  0)
        (0.7980  1.9299  0)
        (0.9128  1.9016  0)
        (1.0276  1.8714  0)
        (1.1424  1.8408  0)
        (1.2572  1.8109  0)
        (1.3720  1.7818  0)
        (1.4869  1.7534  0)
        (1.6017  1.7254  0)
        (1.7165  1.6978  0)
        (1.8313  1.6704  0)
        (1.9461  1.6436  0)
        (2.0609  1.6180  0)
        (2.1757  1.5941  0)
        (2.2906  1.5724  0)
        (2.4054  1.5535  0)
        (2.5202  1.5374  0)
        (2.6350  1.5241  0)
        (2.7498  1.5137  0)
        (2.8646  1.5062  0)
        (2.9794  1.5016  0)
        (3.0943  1.5000  0)
    )
    spline 13 9
    (
        (8.8909  2.0000  0)
        (8.7761  1.9996  0)
        (8.6613  1.9964  0)
        (8.5465  1.9888  0)
        (8.4317  1.9751  0)
        (8.3169  1.9549  0)
        (8.2020  1.9299  0)
        (8.0872  1.9016  0)
        (7.9724  1.8714  0)
        (7.8576  1.8408  0)
        (7.7428  1.8109  0)
        (7.6280  1.7818  0)
        (7.5131  1.7534  0)
        (7.3983  1.7254  0)
        (7.2835  1.6978  0)
        (7.1687  1.6704  0)
        (7.0539  1.6436  0)
        (6.9391  1.6180  0)
        (6.8243  1.5941  0)
        (6.7094  1.5724  0)
        (6.5946  1.5535  0)
        (6.4798  1.5374  0)
        (6.3650  1.5241  0)
        (6.2502  1.5137  0)
        (6.1354  1.5062  0)
        (6.0206  1.5016  0)
        (5.9057  1.5000  0)
    )
    // the same on the backside
    spline 4 5
    (
        (0.1607  0.9980  $Width)
        (0.3250  0.9629  $Width)
        (0.4893  0.8652  $Width)
        (0.6536  0.7306  $Width)
        (0.8179  0.5925  $Width)
        (0.9821  0.4620  $Width)
        (1.1464  0.3354  $Width)
        (1.3107  0.2164  $Width)
        (1.4750  0.1178  $Width)
        (1.6393  0.0482  $Width)
        (1.8036  0.0091  $Width)
        (1.9286   0      $Width)
        (2        0      $Width)
        (2.15     0      $Width)
        (2.3      0      $Width)
        (2.45     0      $Width)
        (2.6      0      $Width)
        (2.75     0      $Width)
        (2.87     0      $Width)
        (3        0      $Width)
    )
    spline 14 10
    (
        (8.8393  0.9980  $Width)
        (8.6750  0.9629  $Width)
        (8.5107  0.8652  $Width)
        (8.3464  0.7306  $Width)
        (8.1821  0.5925  $Width)
        (8.0179  0.4620  $Width)
        (7.8536  0.3354  $Width)
        (7.6893  0.2164  $Width)
        (7.5250  0.1178  $Width)
        (7.3607  0.0482  $Width)
        (7.1964  0.0091  $Width)
        (7.0714   0      $Width)
        (7        0      $Width)
        (6.85     0      $Width)
        (6.7      0      $Width)
        (6.55     0      $Width)
        (6.4      0      $Width)
        (6.25     0      $Width)
        (6.13     0      $Width)
        (6        0      $Width)
    )
    spline 7 6
    (
        (0.1091  2.0000  $Width)
        (0.2239  1.9996  $Width)
        (0.3387  1.9964  $Width)
        (0.4535  1.9888  $Width)
        (0.5683  1.9751  $Width)
        (0.6831  1.9549  $Width)
        (0.7980  1.9299  $Width)
        (0.9128  1.9016  $Width)
        (1.0276  1.8714  $Width)
        (1.1424  1.8408  $Width)
        (1.2572  1.8109  $Width)
        (1.3720  1.7818  $Width)
        (1.4869  1.7534  $Width)
        (1.6017  1.7254  $Width)
        (1.7165  1.6978  $Width)
        (1.8313  1.6704  $Width)
        (1.9461  1.6436  $Width)
        (2.0609  1.6180  $Width)
        (2.1757  1.5941  $Width)
        (2.2906  1.5724  $Width)
        (2.4054  1.5535  $Width)
        (2.5202  1.5374  $Width)
        (2.6350  1.5241  $Width)
        (2.7498  1.5137  $Width)
        (2.8646  1.5062  $Width)
        (2.9794  1.5016  $Width)
        (3.0943  1.5000  $Width)
    )
    spline 15 11
    (
        (8.8909  2.0000  $Width)
        (8.7761  1.9996  $Width)
        (8.6613  1.9964  $Width)
        (8.5465  1.9888  $Width)
        (8.4317  1.9751  $Width)
        (8.3169  1.9549  $Width)
        (8.2020  1.9299  $Width)
        (8.0872  1.9016  $Width)
        (7.9724  1.8714  $Width)
        (7.8576  1.8408  $Width)
        (7.7428  1.8109  $Width)
        (7.6280  1.7818  $Width)
        (7.5131  1.7534  $Width)
        (7.3983  1.7254  $Width)
        (7.2835  1.6978  $Width)
        (7.1687  1.6704  $Width)
        (7.0539  1.6436  $Width)
        (6.9391  1.6180  $Width)
        (6.8243  1.5941  $Width)
        (6.7094  1.5724  $Width)
        (6.5946  1.5535  $Width)
        (6.4798  1.5374  $Width)
        (6.3650  1.5241  $Width)
        (6.2502  1.5137  $Width)
        (6.1354  1.5062  $Width)
        (6.0206  1.5016  $Width)
        (5.9057  1.5000  $Width)
    )

    // spline 12 25
    // (
    //     (9.1607    0.9980 0)
    //     (9.3250    0.9629 0)
    //     (9.4893    0.8652 0)
    //     (9.6536    0.7306 0)
    //     (9.8179    0.5925 0)
    //     (9.9821    0.4620 0)
    //     (10.1464    0.3354 0)
    //     (10.3107    0.2164 0)
    //     (10.4750    0.1178 0)
    //     (10.6393    0.0482 0)
    //     (10.8036    0.0091 0)
    //     (10.9286    0      0)
    //     (11         0      0)
    //     (11.15      0      0)
    //     (11.3       0      0)
    //     (11.45      0      0)
    //     (11.6       0      0)
    //     (11.75      0      0)
    //     (11.87      0      0)
    //     (12         0      0)
    // )
    // spline  36 32
    // (
    //     (17.8393  0.9980  0)
    //     (17.6750  0.9629  0)
    //     (17.5107  0.8652  0)
    //     (17.3464  0.7306  0)
    //     (17.1821  0.5925  0)
    //     (17.0179  0.4620  0)
    //     (16.8536  0.3354  0)
    //     (16.6893  0.2164  0)
    //     (16.5250  0.1178  0)
    //     (16.3607  0.0482  0)
    //     (16.1964  0.0091  0)
    //     (16.0714  0       0)
    //     (16       0       0)
    //     (15.85    0       0)
    //     (15.7     0       0)
    //     (15.55    0       0)
    //     (15.4     0       0)
    //     (15.25    0       0)
    //     (15.13    0       0)
    //     (15       0       0)
    // )
    // spline 13 26
    // (
    //     (9.1091  2.0000  0)
    //     (9.2239  1.9996  0)
    //     (9.3387  1.9964  0)
    //     (9.4535  1.9888  0)
    //     (9.5683  1.9751  0)
    //     (9.6831  1.9549  0)
    //     (9.7980  1.9299  0)
    //     (9.9128  1.9016  0)
    //     (10.0276  1.8714  0)
    //     (10.1424  1.8408  0)
    //     (10.2572  1.8109  0)
    //     (10.3720  1.7818  0)
    //     (10.4869  1.7534  0)
    //     (10.6017  1.7254  0)
    //     (10.7165  1.6978  0)
    //     (10.8313  1.6704  0)
    //     (10.9461  1.6436  0)
    //     (11.0609  1.6180  0)
    //     (11.1757  1.5941  0)
    //     (11.2906  1.5724  0)
    //     (11.4054  1.5535  0)
    //     (11.5202  1.5374  0)
    //     (11.6350  1.5241  0)
    //     (11.7498  1.5137  0)
    //     (11.8646  1.5062  0)
    //     (11.9794  1.5016  0)
    //     (12.0943  1.5000  0)
    // )
    // spline 37 33
    // (
    //     (17.8909  2.0000  0)
    //     (17.7761  1.9996  0)
    //     (17.6613  1.9964  0)
    //     (17.5465  1.9888  0)
    //     (17.4317  1.9751  0)
    //     (17.3169  1.9549  0)
    //     (17.2020  1.9299  0)
    //     (17.0872  1.9016  0)
    //     (16.9724  1.8714  0)
    //     (16.8576  1.8408  0)
    //     (16.7428  1.8109  0)
    //     (16.6280  1.7818  0)
    //     (16.5131  1.7534  0)
    //     (16.3983  1.7254  0)
    //     (16.2835  1.6978  0)
    //     (16.1687  1.6704  0)
    //     (16.0539  1.6436  0)
    //     (15.9391  1.6180  0)
    //     (15.8243  1.5941  0)
    //     (15.7094  1.5724  0)
    //     (15.5946  1.5535  0)
    //     (15.4798  1.5374  0)
    //     (15.3650  1.5241  0)
    //     (15.2502  1.5137  0)
    //     (15.1354  1.5062  0)
    //     (15.0206  1.5016  0)
    //     (14.9057  1.5000  0)
    // )
    // // the same on the backside
    // spline 14 29
    // (
    //     (9.1607  0.9980  $Width)
    //     (9.3250  0.9629  $Width)
    //     (9.4893  0.8652  $Width)
    //     (9.6536  0.7306  $Width)
    //     (9.8179  0.5925  $Width)
    //     (9.9821  0.4620  $Width)
    //     (10.1464  0.3354  $Width)
    //     (10.3107  0.2164  $Width)
    //     (10.4750  0.1178  $Width)
    //     (10.6393  0.0482  $Width)
    //     (10.8036  0.0091  $Width)
    //     (10.9286   0      $Width)
    //     (11        0      $Width)
    //     (11.15     0      $Width)
    //     (11.3      0      $Width)
    //     (11.45     0      $Width)
    //     (11.6      0      $Width)
    //     (11.75     0      $Width)
    //     (11.87     0      $Width)
    //     (12        0      $Width)
    // )
    // spline 38 34
    // (
    //     (17.8393  0.9980  $Width)
    //     (17.6750  0.9629  $Width)
    //     (17.5107  0.8652  $Width)
    //     (17.3464  0.7306  $Width)
    //     (17.1821  0.5925  $Width)
    //     (17.0179  0.4620  $Width)
    //     (16.8536  0.3354  $Width)
    //     (16.6893  0.2164  $Width)
    //     (16.5250  0.1178  $Width)
    //     (16.3607  0.0482  $Width)
    //     (16.1964  0.0091  $Width)
    //     (16.0714   0      $Width)
    //     (16        0      $Width)
    //     (15.85     0      $Width)
    //     (15.7      0      $Width)
    //     (15.55     0      $Width)
    //     (15.4      0      $Width)
    //     (15.25     0      $Width)
    //     (15.13     0      $Width)
    //     (15        0      $Width)
    // )
    // spline 15 30
    // (
    //     (9.1091  2.0000  $Width)
    //     (9.2239  1.9996  $Width)
    //     (9.3387  1.9964  $Width)
    //     (9.4535  1.9888  $Width)
    //     (9.5683  1.9751  $Width)
    //     (9.6831  1.9549  $Width)
    //     (9.7980  1.9299  $Width)
    //     (9.9128  1.9016  $Width)
    //     (10.0276  1.8714  $Width)
    //     (10.1424  1.8408  $Width)
    //     (10.2572  1.8109  $Width)
    //     (10.3720  1.7818  $Width)
    //     (10.4869  1.7534  $Width)
    //     (10.6017  1.7254  $Width)
    //     (10.7165  1.6978  $Width)
    //     (10.8313  1.6704  $Width)
    //     (10.9461  1.6436  $Width)
    //     (11.0609  1.6180  $Width)
    //     (11.1757  1.5941  $Width)
    //     (11.2906  1.5724  $Width)
    //     (11.4054  1.5535  $Width)
    //     (11.5202  1.5374  $Width)
    //     (11.6350  1.5241  $Width)
    //     (11.7498  1.5137  $Width)
    //     (11.8646  1.5062  $Width)
    //     (11.9794  1.5016  $Width)
    //     (12.0943  1.5000  $Width)
    // )
    // spline 39 35
    // (
    //     (17.8909  2.0000  $Width)
    //     (17.7761  1.9996  $Width)
    //     (17.6613  1.9964  $Width)
    //     (17.5465  1.9888  $Width)
    //     (17.4317  1.9751  $Width)
    //     (17.3169  1.9549  $Width)
    //     (17.2020  1.9299  $Width)
    //     (17.0872  1.9016  $Width)
    //     (16.9724  1.8714  $Width)
    //     (16.8576  1.8408  $Width)
    //     (16.7428  1.8109  $Width)
    //     (16.6280  1.7818  $Width)
    //     (16.5131  1.7534  $Width)
    //     (16.3983  1.7254  $Width)
    //     (16.2835  1.6978  $Width)
    //     (16.1687  1.6704  $Width)
    //     (16.0539  1.6436  $Width)
    //     (15.9391  1.6180  $Width)
    //     (15.8243  1.5941  $Width)
    //     (15.7094  1.5724  $Width)
    //     (15.5946  1.5535  $Width)
    //     (15.4798  1.5374  $Width)
    //     (15.3650  1.5241  $Width)
    //     (15.2502  1.5137  $Width)
    //     (15.1354  1.5062  $Width)
    //     (15.0206  1.5016  $Width)
    //     (14.9057  1.5000  $Width)
    // )
);

boundary
(
    topWall
    {
        type wall;
    	faces
        (
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
            // (19 41 45 23)
            // (41 42 46 45)
            // (42 43 47 46)
        );
    }
    bottomWall
    {
        type wall;
    	faces
        (
            (0 4 5 1)
            (5 10 8 1)
            (8 10 14 12)
            // (12 14 29 25)
            // (29 34 32 25)
            // (32 34 38 36)
        );
    }
    inlet //bottom
    {
        type mappedPatch;
        offset          (9 0 0);
        sampleRegion    region0;
        sampleMode      nearestCell;
        samplePatch     none;
    	faces
        (
            (0 3 7 4)
            (16 20 7 3)
        );
    }
    outlet //bottom
    {
        type            patch;
	    faces
        (
            (12 14 15 13)
            (19 13 15 23)
            // (36 38 39 37)
            // (43 37 39 47)
        );
    }
);

mergePatchPairs
(
);
