tutorials/pehill_nut/nutfoam_inputs/foam_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       2920;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       2970;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       3020;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          30;
        startFace       3050;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3000;
        startFace       3080;
    }
)

// ************************************************************************* //
